Repository: Robotonics/pinguino32
Catalog: ide/x.4/locale/*/LC_MESSAGES/pinguino.po
Languages: fr

source: New
fr: Nouveau

source: Open
fr: Ouvrir

source: Save
fr: Sauver

source: Save as
fr: Enregistrer sous

source: Close
fr: Fermer

source: Save all
fr: Sauvegarder tous les fichiers

source: Close all
fr: Fermer tous les fichiers

source: Recents
fr: Ouverts récemment

source: Exit
fr: Quitter

source: File
fr: Fichier

source: Undo
fr: Annuler

source: Redo
fr: Rétablir

source: Show Auto-completer
fr: Afficher la saisie automatique

source: Comment/Uncomment
fr: Commenter/Décommenter

source: Increase Indent
fr: Augmenter l'identation

source: Decrease Indent
fr: Diminuer l'identation

source: Find
fr: Rechercher

source: Replace
fr: Remplacer

source: Cut
fr: Couper

source: Copy
fr: Copier

source: Paste
fr: Coller

source: Clear
fr: Effacer

source: Select all
fr: Sélectionner tout

source: Preferences...
fr: Configuration...

source: Edit
fr: Editer

source: Tools
fr: Outils

source: Output
fr: Fenêtre des messages

source: Toolbar
fr: Barre d'outils

source: View
fr: Vue

source: Selector Board
fr: Sélecteur de Carte

source: USB CDC (serial emulation)
fr: USB CDC (émulation série)

source: View stdout
fr: Afficher messages de compilation

source: Upload
fr: Envoyer vers Pinguino

source: Compile
fr: Compiler le programme

source: If Compile then Upload
fr: Compilation et envoi du programme

source: Pinguino
fr: Envoyer vers Pinguino

source: Keywords
fr: Mots-clés

source: Website
fr: Site Web

source: Group
fr: Groupe Google

source: Shop
fr: Boutique

source: Links
fr: Liens

source: About...
fr: A propos ...

source: Help
fr: Aide

source: Pinguino IDE - Preferences
fr: Préférences

source: Appearance
fr: Apparence

source: Source Code Font/Size
fr: Taille de la Police

source: Highlight
fr: Surbrillance

source: Others
fr: Autres

source: Auto-completion
fr: Saisie automatique

source: Open/Save files
fr: Ouvrir/Sauvegarder le fichier

source: Theme
fr: Thèmes

source: appearance
fr: apparence

source: Use default
fr: Configuration par défaut

source: Use selected
fr: Utiliser la police

source: Also use in the output
fr: également pour la fenêtre des messages

source: Tab size
fr: Taille tabulation

source: souce_code_font_size
fr: Taille police code source

source: Search and Replace
fr: Cherche et remplace

source: Code Navigation
fr: Marqueurs Début-Fin (), {}, ...

source: Selection
fr: Sélectionner tout

source: Error Line
fr: Ligne d'erreur

source: highligh
fr: surbrillance

source: Source online doc:
fr: Source de la documentation

source: Pinguino wiki official
fr: Wiki Pinguino Officiel

source: PinguinoVE wiki
fr: Wiki Pinguino de la communauté Vénézuelienne

source: others
fr: autres

source: Source completion
fr: Caractéristiques

source: After characters
fr: Après ... caractères

source: Disable auto-completer
fr: Désactiver saisie automatique

source: Items count
fr: Propositions max.

source: Insert arguments with "("
fr: Fonction toujours suivie d'une "("

source: Auto-close
fr: fermeture automatique

source: Brackets: []
fr: Crochets: []

source: Keys: {}
fr: Accolades: {}

source: Parentheses: ()
fr: Parenthèses: ()

source: Double quotes: "
fr: Guillemets

source: Single quotes: '
fr: Apostrophe

source: autocompletion
fr: saisie automatique

source: New file
fr: Nouveau fichier

source: With template
fr: Avec modèle

source: Empty
fr: Vide

source: Auto-save
fr: Sauvegarde automatique

source: Each (sec)
fr: Chaque (sec.)

source: Never
fr: Jamais

source: Open last files
fr: Ouvrir les derniers fichiers

source: All existing files
fr: Tous les fichiers existants

source: Files
fr: Fichiers

source: Search
fr: Recherche

source: Pinguino IDE requires a restart to reinitialize its config.
fr: La nouvelle config. ne sera prise en compte qu'au prochain démarrage.

source: Restore Defaults
fr: Revenir à la configuration par défaut

source: Apply
fr: Appliquer

source: Pinguino IDE - Online docs
fr: Documentation en ligne

source: Pinguino IDE x.4
fr: EDI Pinguino X.4

source: Editor
fr: Éditeur

source: Send
fr: Envoyé

source: Functions
fr: Fonctions

source: Directories
fr: Répertoires

source: Select a folder
fr: Choississez un répertoire

source: Search:
fr: Recherche:

source: Replace:
fr: Remplacer:

source: Case sensitive
fr: Sensible à la casse

source: Previous
fr: Précédent

source: Next
fr: Suivant

source: Replace all
fr: Tout remplacer

source: Auto-completer
fr: Saisie automatique

source: Pinguino IDE - Stdout
fr: Messages de compilation

source: Pinguino IDE - Board Selector
fr: Sélecteur de carte

source: 8-bit
fr: 8 bits

source: 32-bit
fr: 32 bits

source: Programming Mode
fr: Mode de programmation

source: Sort
fr: Trier

source: Device
fr: Cartes

source: Devices
fr: Cartes

source: Choose a file
fr: Choisir un fichier

source: File is already opened, reload it ?
fr: Le fichier est déjà ouvert, le recharger ?

source: Warning
fr: Attention

source: Save file as
fr: Sauvegarder le fichier en le renommant

source: File already exist, Overwrite it ?
fr: Le fichier existe déjà, faut-il effacer l'ancienne version ?

source: Save file ?
fr: Sauver le fichier ?

source: No ports
fr: Pas de port

source: Connected
fr: Connecté

source: Debugging!
fr: Débogage

source: No device connected
fr: Aucun Pinguino connecté

source: device disconnected
fr: Pinguino déconnecté

source: Welcome to Pinguino IDE
fr: Bienvenue dans l'EDI Pinguino

source: Changing board
fr: Changement de carte

source: Please wait a moment.
fr: Patientez, SVP

source: Open file first !!
fr: Ouvrez d'abord un fichier !!

source: Board:
fr: Carte:

source: File:
fr: Fichier:

source: compiling
fr: compilation

source: error while compiling
fr: erreur de compilation

source: check highlighted lines in your code
fr: vérifiez les lignes surlignées

source: You can review the file stdout (F8) for more information.
fr: Lire (F8) les messages du compilateur pour plus d'information

source: error while linking
fr: erreur à l'édition de liens

source: compilation done
fr: compilation terminée

source: seconds process time
fr: secondes (traitement)

source: File must be verified/compiled before upload
fr: Le fichier doit être compilé avant d'être chargé

source: Warning!
fr: Attention !

source: File must be saved before upload
fr: Le fichier doit être sauvegardé avant d'être chargé

source: Board config
fr: Configuration de la carte

source: Name
fr: Nom

source: In function
fr: En marche

source: Line
fr: Ligne

source: Return
fr: Retour

source: Parameters
fr: Paramètres

source: Value
fr: Valeur

source: Open wiki page in the web browser
fr: Ouvrir le Wiki dans votre navigateur

source: Read description
fr: Lire la documentation

source: Clear All
fr: Tout effacer

source: New File
fr: Nouveau fichier

source: Open File
fr: Ouvrir un fichier

source: Save File
fr: Sauvegarder le fichier

source: Close File
fr: Fermer le fichier

source: Select
fr: Sélectionner tout

source: Search in File
fr: Chercher dans le fichier

source: Replace in File
fr: Remplacer dans le fichier

source: Select a board
fr: Sélectionner une carte

source: Upload to Pinguino Board
fr: Envoyer vers le Pinguino

source: set preferences of Pinguino IDE
fr: modifier les options de l'EDI

source: Exit Pinguino IDE
fr: Quitter l'EDI Pinguino
